CodeIgniter/app/Controllers/SalasDeletar.php

    public function index()
    {
        $salaModel = new \App\Models\SalaModel();
        $data['salas'] = $salaModel->findAll(); // Busca todas as salas
---
SELECT *
FROM `Salas`